mood_to_tags = {
    "Устал": [
        {"tag": "рутинная", "impact": 3},
        {"tag": "короткая", "impact": 6},
        {"tag": "лень", "impact": 2},
        {"tag": "низкая_энергия", "impact": 4},
        {"tag": "быстрая_победа", "impact": 8}
    ],
    "Полон энергии": [
        {"tag": "высокий_приоритет", "impact": 9},
        {"tag": "творческая", "impact": 8},
        {"tag": "интеллектуальная", "impact": 8},
        {"tag": "важная", "impact": 9}
    ],
    "Тревожный": [
        {"tag": "рутинная", "impact": 5},
        {"tag": "короткая", "impact": 7},
        {"tag": "планирование", "impact": 6},
        {"tag": "быстрая_победа", "impact": 7},
        {"tag": "лёгкая", "impact": 6}
    ],
    "Сосредоточен": [
        {"tag": "средняя", "impact": 5},
        {"tag": "интеллектуальная", "impact": 8},
        {"tag": "высокий_приоритет", "impact": 9},
        {"tag": "творческая", "impact": 7}
    ],
    "Счастлив": [
        {"tag": "творческая", "impact": 9},
        {"tag": "важная", "impact": 8},
        {"tag": "рутинная", "impact": 6},
        {"tag": "мозговой_штурм", "impact": 8}
    ],
    "Раздражён": [
        {"tag": "быстрая_победа", "impact": 8},
        {"tag": "короткая", "impact": 7},
        {"tag": "лень", "impact": 3},
        {"tag": "рутинная", "impact": 5}
    ],
    "Не в духе": [
        {"tag": "лёгкая", "impact": 7},
        {"tag": "рутинная", "impact": 5},
        {"tag": "быстрая_победа", "impact": 8},
        {"tag": "низкая_энергия", "impact": 4},
        {"tag": "короткая", "impact": 7}
    ],
    "Вдохновлён": [
        {"tag": "творческая", "impact": 10},
        {"tag": "интеллектуальная", "impact": 9},
        {"tag": "важная", "impact": 9},
        {"tag": "долгая", "impact": 8},
        {"tag": "высокий_приоритет", "impact": 9}
    ],
    "Перегружен": [
        {"tag": "низкая_энергия", "impact": 3},
        {"tag": "рутинная", "impact": 5},
        {"tag": "короткая", "impact": 7},
        {"tag": "прокрастинация", "impact": 2}
    ],
    "Продуктивен": [
        {"tag": "высокий_приоритет", "impact": 9},
        {"tag": "важная", "impact": 8},
        {"tag": "долгая", "impact": 8},
        {"tag": "интеллектуальная", "impact": 9}
    ],
    "Лень": [
        {"tag": "лень", "impact": 3},
        {"tag": "быстрая_победа", "impact": 8},
        {"tag": "рутинная", "impact": 5},
        {"tag": "низкая_энергия", "impact": 4}
    ]
}
